Tekla Open API Reference for Tekla Structures 2025
LineSegment Properties
The LineSegment type exposes the following members.
Properties
Name | Description
EndPoint
 Gets the end point of the line segment
Point1
 Gets the start point of the line segment
Point2
 Gets the end point of the line segment
StartPoint
 Gets the start point of the line segment
Top
See Also
Reference
LineSegment Class
Tekla.Structures.Geometry3d Namespace